# St7InvertPathNormal

Inverts the normal direction of selected load paths. The ends of the path are not flipped.

long St7InvertPathNormal(long uID)
Input Parameters
uID
Strand7 model file ID.
Dependencies
Selection
Load paths can be selected using functions in Entity Selection.
Keep Selected
Assigned using St7SetKeepSelect.